In [2]:
import pandas as pd
import numpy as np
import matplotlib as plt

In [1]:
!ls

Data Ingestion.ipynb
IntroToPandas.ipynb
String Operations.ipynb
Week-4-Pandas
__MACOSX

In [3]:
movies = pd.read_csv('Week-4-Pandas/ml-latest-small/movies.csv', sep = ',')
movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [4]:
tags = pd.read_csv('Week-4-Pandas/ml-latest-small/tags.csv', sep = ',')
tags.head()

   userId  movieId              tag   timestamp
0       2    60756            funny  1445714994
1       2    60756  Highly quotable  1445714996
2       2    60756     will ferrell  1445714992
3       2    89774     Boxing story  1445715207
4       2    89774              MMA  1445715200

In [5]:
ratings = pd.read_csv('Week-4-Pandas/ml-latest-small/ratings.csv', sep= ',')
ratings.head()

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

In [11]:
cust_ratings = ratings[ratings['userId'] == 2]
cust_ratings.head()

     userId  movieId  rating   timestamp
232       2      318     3.0  1445714835
233       2      333     4.0  1445715029
234       2     1704     4.5  1445715228
235       2     3578     4.0  1445714885
236       2     6874     4.0  1445714952

In [12]:
cust_ratings[cust_ratings['movieId'] == 60756]

     userId  movieId  rating   timestamp
241       2    60756     5.0  1445714980

In [15]:
# ratings[ratings['userId'] == 2 & ratings['movieId'] == 60756]
# error

In [16]:
movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [18]:
yearSplit = movies['title'].str.split('(')
yearSplit.head()

0                      [Toy Story , 1995)]
1                        [Jumanji , 1995)]
2               [Grumpier Old Men , 1995)]
3              [Waiting to Exhale , 1995)]
4    [Father of the Bride Part II , 1995)]
Name: title, dtype: object

In [19]:
type(yearSplit)

pandas.core.series.Series

In [20]:
yearMovies = movies.copy()

In [27]:
yearMovies['Year'] = yearSplit
yearMovies.head()

,movieId,title,genres,Year
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,"[Toy Story , 1995)]"
1,2,Jumanji (1995),Adventure|Children|Fantasy,"[Jumanji , 1995)]"
2,3,Grumpier Old Men (1995),Comedy|Romance,"[Grumpier Old Men , 1995)]"
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance,"[Waiting to Exhale , 1995)]"
4,5,Father of the Bride Part II (1995),Comedy,"[Father of the Bride Part II , 1995)]"

In [25]:
yearSplit.head()

0                      [Toy Story , 1995)]
1                        [Jumanji , 1995)]
2               [Grumpier Old Men , 1995)]
3              [Waiting to Exhale , 1995)]
4    [Father of the Bride Part II , 1995)]
Name: title, dtype: object

# Time Stamp

In [29]:
tags.head()

   userId  movieId              tag   timestamp
0       2    60756            funny  1445714994
1       2    60756  Highly quotable  1445714996
2       2    60756     will ferrell  1445714992
3       2    89774     Boxing story  1445715207
4       2    89774              MMA  1445715200

In [30]:
timeStamp = tags.copy()

In [33]:
timeStamp['parsed_time'] = pd.to_datetime(tags['timestamp'], unit='s')
timeStamp.head()

   userId  movieId              tag   timestamp         parsed_time
0       2    60756            funny  1445714994 2015-10-24 19:29:54
1       2    60756  Highly quotable  1445714996 2015-10-24 19:29:56
2       2    60756     will ferrell  1445714992 2015-10-24 19:29:52
3       2    89774     Boxing story  1445715207 2015-10-24 19:33:27
4       2    89774              MMA  1445715200 2015-10-24 19:33:20

In [34]:
ser = pd.Series([100, 200, 300, 400, 500], index = ['tom', 'bob', 'nancy', 'dan', 'eric'])

In [35]:
ser.head()

tom      100
bob      200
nancy    300
dan      400
eric     500
dtype: int64

In [39]:
ser.loc[['tom', 'bob']]

tom    100
bob    200
dtype: int64

In [40]:
ser.iloc[[0, 1]]

tom    100
bob    200
dtype: int64

In [41]:
ser[[0, 1]]

tom    100
bob    200
dtype: int64

In [42]:
PanDict = {0 : pd.Series([100, 200, 300, 400, 500], index = ['tom', 'bob', 'nancy', 'dan', 'eric']), 1 : pd.Series([100, 200, 300, 400, 500], index = ['tom', 'bob', 'nancy', 'dan', 'eric'])}

In [44]:
tempDF = pd.DataFrame(PanDict)